# DataFrames Pt. 1

> DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

# In Pt. 1 we cover the following : 
* Create a basic DataFrame
* Indexing
* Selection
* Dropping rows and cols and importance of inplace parameter.
* Reasoning behind axis = 0 for rows and axis = 1 for columns.
* Accessing rows and cols in DataFrame

In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [22]:
# For having gridlines

In [23]:
%%HTML
<style type="text/css">
table.dataframe td, table.dataframe th {
    border: 1px  black solid !important;
  color: black !important;
}

In [3]:
#  Setting a seed -> Seed makes sure that we get the same random numbers.
np.random.seed(101)

In [4]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [15]:
df # Gives us a list of columns W X Y Z, and rows A B C D E.
# Each of the columns is a pandas sereis, W X Y and Z are series sharing a common index.
# That's what dataframe is, a bunch of series that shares an index.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

# Indexing and Selection

In [7]:
df['W']# Grabs W column which looks like a series. Always use this way to grab a column.

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [8]:
type(df['W']) # Shows that it is a series

pandas.core.series.Series

In [9]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df.W # If familiar with SQL a lot of times while selecting a column you pass in the table.col_name and this works too!
# Not recommended!

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [14]:
# You can also pass in a list of columns
df[['W','Z']] # Asking for multiple columns you get back a DataFrame while a single column is just a series.

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [16]:
df['new'] = df['W']+df['Y']
# When creating a new columnm, we can define it as if it already exists and on the RHS of = sign use other cols with 
# arithmetic to make a new column.

In [24]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

**To remove a column we use df.drop() and pass in the column name. Also we need to refer to axis = 1, by default axis is set to 0.**

In [26]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
# df.drop() usage doesn't actually affects the DataFrame as we can see below on calling DataFrame df.
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [28]:
# To actually remove column new we have to enter the parameter inplace = True
# Pandas does this so that we do not lose valuable information while dropping.
df.drop('new',axis=1,inplace=True)

In [30]:
df#New column permanently removed.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
# df.drop() also used to drop rows.
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

**Another point of confusion is why are rows have axis = 0 and columns have axis = 1.
Its reference comes back to NumPy. Since DataFrames are just fancy index markers on top of a NumPy Array.**

In [36]:
# As a proof of logic we can do the following
df.shape

(5, 4)

**Notice that df.shape is a tuple for a 2-D matrix, at 0 index  is the number of rows and columns at index1.**

**Therefore rows as axis = 0 and columns as axis = 1 .**

# Rows
* 1st method to grab a row : Based on the label of index
* loc[]

In [37]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
# Multiple ways to select rows by making use of method(). 
# 1. loc (location) -> Takes label as input
df.loc['C'] # Though it is a method still we use square brackets here, that's how it works with Pandas.

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

**df.loc['row_you_want']**
* returns a series. 
* Therefore, not only all columns are series but rows are as well and are returned as series when requested.

> 2nd method to grab a row : Based on the index position instead of label
# iloc : 
> index based location Used to pass in a numerical index position, even if axes are labelled by strings.

In [43]:
df.iloc[2] # Numerical based index.

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [44]:
# To select subsets of rows and columns. Similar to numpy
df.loc['B','Y']# df.loc['row_we_want','column_we_want']

-0.8480769834036315

In [46]:
# A to E rows with W & Y columns
df.loc[['A','B','C','D','E'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

# DataFrames Pt. 2

# In Pt. 2 we cover the following : 
* Conditional Selection
* Single line v/s Multiple line abstraction
* Using multiple conditions
* Reason and fix for ambiguous series error
* Modifying the index (Set Index v/s Reset Index)
*

In [47]:
#  We can perform conditional selection in Pandas using bracket notation.
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [51]:
booldf = df > 0 #Using a comparison operator against the DataFrame gives a DataFrame of boolean values. 
# Similar to what happens to a numpy array when you just apply a conditional selection.

In [52]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [54]:
df[booldf] #We will get values where the condition was True and NaN (Not a Number) for all false locations.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [59]:
# Ideal way to do contional selection is what's defined below. What we did above was just for ease of understanding.
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

> **But the method above of conditional selection is also uncommon and most likely instead of just passing the entire data frame, we would pass a row or a column value and instead of returning NaN it will return only the rows or columns of the subsets of the dataframe where conditions are true.**

In [61]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [62]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [64]:
df['W'] # Value at index C is less than 0, so returns false for being greater than zero.

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [65]:
# Now we can use the series of boolean values corresponding to rows which is shown  above to filter out rows
# based on a column's value.
df[df['W']>0] # Returns only the rows where condition is true. We use this type of selection a lot!
# As we are passing the series we do not get null values anymore.
# Null values only occur when you perform a conditional statement on the entire DataFrame.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [66]:
#  To grab all the rows in the dataframe where Z < 0
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [67]:
resultdf = df[df['W']>0] # Note that we get a DF in response. And this means we can call commands on this DF.
# We can do so in 1 or 2 steps.

In [71]:
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [72]:
resultdf['X'] # Grabbing the X column from the resultdf DF where C is not present. We do this here in 2 steps.

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [75]:
# Doing it in 1 step will look like what's described below :
df[df['W']>0]['X'] # Return the dataframe where column value of W > 0 i.e. All Rows - C. Then stacking [] bracket 
# notation on top of that.

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [76]:
df[df['W']>0][['X','Y','Z']] #Since this is a dataframe we can bracket for multiple columns by passing in a list.

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [77]:
#  Line by line version for undestanding of the command above is
boolser = df['W']>0

In [78]:
boolser

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [79]:
result = df[boolser]

In [80]:
result # Entire DataFrame without row C since it was False.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [81]:
mycols = ['X','Y','Z']

In [82]:
result[mycols] #Only print the mycols columns from result DataFrame.

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

# Using multiple conditions

In [87]:
df[(df['W']>0) and (df['Y']>1)]# W > 0 and Y>1 
# Gives us an error saying "truth value of a Series is ambiguous."
# It basically means python's and operator can't take into account one series of boolean value with respect to other.

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [89]:
# and operator can take into account only boolean values. For instance
print(True and True)
print(False and True)

True
False

In [90]:
# On passing the entire series of boolean values such as 
df['W']>0
# the and operator begins to get confused as it deals with single instances of boolean values only.

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [92]:
# Workaround is to use an & while working with pandas.
df[(df['W']>0) & (df['Y']>1)]# W > 0 and Y>1

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

### To avoid ambiguous series error : 
> * **Use & instead of and**
> * **Use | instead of or**

# Modifying the Index

In [94]:
df #Original DF

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [95]:
# To reset the index in range 0....n-1 
df.reset_index() # index gets reset to a column and actual index becomes numerical, all of this to prevent loss of 
#data. Again keep in mind it doesn't occurs inplace and calling back the original df will show us what is above.

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [96]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [97]:
# To make the change permanent use inplace in the following manner : 
# df.reset_index(inplace=True)

In [102]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z']) # To get the original index with string index.

In [103]:
 df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [104]:
df.reset_index() # Old Index becomes a column of the dataframe.

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [105]:
#Setting the index 

newind = 'CG MP UP TN OR'.split() # Creating a new index
# .split() of a string is a common method for splitting off of all the blank space a quick way to create a list.

In [106]:
newind

['CG', 'MP', 'UP', 'TN', 'OR']

In [107]:
#  Putting the list above as column in the DataFrame df
df['States'] = newind # Since the dimensions match. So it will add list as a column.

In [109]:
df # We can see that a new column is added at the end of the df.

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CG
B -0.134841  0.390528  0.166905  0.184502     MP
C  0.807706  0.072960  0.638787  0.329646     UP
D -0.497104 -0.754070 -0.943406  0.484752     TN
E -0.116773  1.901755  0.238127  1.996652     OR

In [111]:
# To make the states column as index make use of method set_index 
df.set_index('States') # States column becomes the index.
# Note : Unless you retain the information of your old index, set_index will overwrite the old index and you
# won't be able to retain the old index information as a new column.
# df remains similar to originally defined as inplace = False which is by default.

               W         X         Y         Z
States
CG      0.302665  1.693723 -1.706086 -1.159119
MP     -0.134841  0.390528  0.166905  0.184502
UP      0.807706  0.072960  0.638787  0.329646
TN     -0.497104 -0.754070 -0.943406  0.484752
OR     -0.116773  1.901755  0.238127  1.996652

In [112]:
df

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CG
B -0.134841  0.390528  0.166905  0.184502     MP
C  0.807706  0.072960  0.638787  0.329646     UP
D -0.497104 -0.754070 -0.943406  0.484752     TN
E -0.116773  1.901755  0.238127  1.996652     OR